###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.mastodon-instance-debian-12-profile will be created
  + resource "aws_iam_instance_profile" "mastodon-instance-debian-12-profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "mastodon-instance-debian-12-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-role"
      + tags_all    = {
          + "Env" = "prd"
        }
      + unique_id   = (known after apply)
    }

  # aws_instance.mastodon-instance-debian-12 will be created
  + resource "aws_instance" "mastodon-instance-debian-12" {
      + ami                                  = "ami-0db11ba8498cef3a2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "mastodon-instance-debian-12-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "mastodon-instance-debian-12"
        }
      + tags_all                             = {
          + "Env"  = "prd"
          + "Name" = "mastodon-instance-debian-12"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "26b1bf9ef0a89180361e8e62aa7cc0eab560778f"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }
    }

  # aws_network_interface.mastodon-instance-debian-12-eni will be created
  + resource "aws_network_interface" "mastodon-instance-debian-12-eni" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = [
          + "sg-02c0fa6e57cd18c58",
        ]
      + source_dest_check         = true
      + subnet_id                 = "subnet-0b5c594203af13ee9"
      + tags                      = {
          + "Name" = "mastodon-instance-eni-debian-12"
        }
      + tags_all                  = {
          + "Env"  = "prd"
          + "Name" = "mastodon-instance-eni-debian-12"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Terraform`*